[
  {
    "img": "/images/news1.png",
    "title": "How To Play Ranked In Rainbow Six Siege",
    "placeholder": "Rainbow Six Siege is a game where going into the higher leagues isn’t as easy as it seems. You need an exceptional level of coordination with your teammates, a good game sense as well as top-notch mechanical skills to be able to survive..."
  },
  {
    "img": "/images/news2.png",
    "title": "The Evolution of FPS Games",
    "placeholder": "From the early days of Doom and Quake to the modern era of Call of Duty and Battlefield, the FPS genre has seen incredible advancements in graphics, gameplay, and storytelling. This article explores the milestones that have shaped first-person shooters over the decades..."
  },
  {
    "img": "/images/news3.png",
    "title": "Top 5 FPS Games to Watch in 2024",
    "placeholder": "As technology continues to push the boundaries of gaming, several upcoming FPS titles are set to make a big splash in 2024. From innovative mechanics to immersive worlds, these games are highly anticipated by both fans and critics alike. Here’s our list of the top 5 FPS games you should keep an eye on..."
  },
  {
    "img": "/images/news4.png",
    "title": "The Impact of Esports on FPS Games",
    "placeholder": "Esports has revolutionized the way we view competitive gaming, especially in the FPS genre. This article delves into how esports tournaments have transformed games like Counter-Strike: Global Offensive and Overwatch, turning them into global phenomena..."
  },
  {
    "img": "/images/news5.png",
    "title": "The Future of VR in FPS Games",
    "placeholder": "Virtual Reality (VR) is steadily making its mark in the FPS genre. With games like Half-Life: Alyx setting new standards, this article explores the potential future of VR FPS games and how they could redefine immersive gameplay experiences..."
  },
  {
    "img": "/images/news6.png",
    "title": "FPS Game Mechanics: What Makes a Shooter Great?",
    "placeholder": "From precise aiming and responsive controls to immersive environments and engaging storylines, several key mechanics define a great FPS game. This piece breaks down these elements and examines how they contribute to the overall success of a shooter..."
  },
  {
    "img": "/images/news7.png",
    "title": "Battle Royale: The Rise and Fall",
    "placeholder": "Battle Royale games like PUBG and Fortnite have taken the FPS world by storm. However, as the genre saturates, some wonder if its popularity is waning. This article looks at the rise of Battle Royale games and speculates on their future in the FPS genre..."
  }
]
